Repository: zyanfx/Zyan
Catalog: source/Zyan.Communication/LanguageResource.*.resx
Languages: de, ru

# ApplicationException_MultipleModuleControlersNotAllowed
source: Multiple module controlers per module are not allowed.
de: Mehrere Modulcontroller im selben Modul sind nicht zulässig.
ru: Несколько контроллеров на один модуль не допускается.

# ArgumentException_ComponentHostNameMissing
source: Component host name missing.
de: Für den Komponentenhost wurde kein Name angegeben!
ru: Имя хоста компонентов не задано.

# ArgumentException_EmptySessionIDIsNotAllowed
source: Empty session ID is not allowed.
de: Leerer Sitzungsschlüssel ist nicht erlaubt!
ru: Пустой идентификатор сессии не допускается.

# ArgumentException_FactoryMethodDelegateMissing
source: Delegate to factory method missing.
de: Keinen Delegaten für Komponentenerzeugung angegeben.
ru: Делегат фабричного метода отсутствует.

# ArgumentException_InterfaceNameMissing
source: Interface name missing.
de: Kein Schnittstellenname angegeben!
ru: Имя интерфейса не задано.

# ArgumentException_InvalidConfigSetting
source: Invalid configuration setting: {0}
de: Ungültige Konfigurationseinstellung: {0}
ru: Недопустимая строка в файле конфигурации: {0}

# ArgumentException_InvalidConnectionAgeLimitSetting
source: Setting 'connectionAgeLimit' must be 0 or greater.
de: Einstellung 'connectionAgeLimit' muss 0 oder größer sein.
ru: Настройка 'connectionAgeLimit' должна быть не меньше 0.

# ArgumentException_InvalidSweepFrequencySetting
source: Setting 'sweepFrequency' must be 0 or greater.
de: Einstellung 'sweepFrequency' muss 0 oder größer sein.
ru: Настройка 'sweepFrequency' должна быть не меньше 0.

# ArgumentException_MaxAttempts
source: Parameter 'maxRetries' must be 1 or greater.
de: Anzahl der Wiederholungsversuche 'maxRetries' muss mindestens auf 1 eingestellt sein.
ru: Параметр 'maxRetries' должен быть не меньше 1.

# ArgumentException_MethodNameMissing
source: Method name missing.
de: Kein Methodenname angegeben!
ru: Название метода отсутствует.

# ArgumentException_ServerUrlMissing
source: Server URL missing.
de: Es wurde kein Server-URL angegeben! Bitte geben Sie einen gültigen Server-URL an, da sonst keine Verbindung zum Komponentenhost aufgebaut werden kann.
ru: URL сервера отсутствует.

# ArgumentException_TypeIsNotAClass
source: The provided implementation type is not a class.
de: Der angegebene Implementierungstyp ist keine Klasse!
ru: Тип, реализующий контракт, должен быть классом.

# ArgumentException_TypeIsNotAInterface
source: The provided interface type is not a interface.
de: Der angegebene Schnittstellentyp ist keine Schnittstelle!
ru: Тип контракта должен быть интерфейсом.

# ArgumentOutOfRangeException_InvalidHttpPortRange
source: The HTTP port must be set within the range 0-65535 liegen.
de: Die HTTP-Anschlussnummer muss im Bereich 0-65535 liegen!
ru: Порт HTTP должен быть в диапазоне 0-65535.

# ArgumentOutOfRangeException_InvalidTcpPortRange
source: The TCP port must be set within the range 0-65535 liegen.
de: Die TCP-Anschlussnummer muss im Bereich 0-65535 liegen!
ru: Порт TCP должен быть в диапазоне 0-65535.

# CryptoRemotingException_ClientConnectionInfoMissing
source: Client connection info missing.
de: Keine passenden Client-Verbindungsinformationen gefunden.
ru: Информация о клиентском соединении отсутствует.

# CryptoRemotingException_InvalidClientRequest
source: Invalid client request: {0}.
de: Ungültige Anfrage vom Client: {0}.
ru: Недопустимый запрос: {0}.

# CryptoRemotingException_InvalidTransactionID
source: Invalid secure transaction ID. May be caused by timeout.
de: Ungültige Sicherheitstransaktionskennung. Möglicherweise wegen Zeitüberschreitung.
ru: Недопустимый идентификатор транзакции. Возможно, транзакция прервана по таймауту.

# CryptoRemotingException_IVMissing
source: Initialization Vector from server missing.
de: Es wurde kein Inizialisierungsvektor vom Server übermittelt.
ru: Вектор инициализации сервера отсутствует.

# CryptoRemotingException_KeyChanged
source: Public key changed since the message was encrypted.
de: Der Schlüssel wurde seit dem verschlüsseln der Nachricht geändert.
ru: Открытый ключ был изменен с момента зашифровки сообщения.

# CryptoRemotingException_PublicKeyNotFound
source: Public key missing.
de: Kein öffentlicher Schlüssel gefunden.
ru: Открытый ключ отсутствует.

# CryptoRemotingException_ServerRequiresEncryption
source: Server requires encrypted connection for this client.
de: Der Server benötigt eine verschlüsselte Verbindung für diesen Client.
ru: Для этого клиента серверу требуется зашифрованное соединение.

# CryptoRemotingException_SharedKeyMissing
source: No public key transmitted.
de: Es wurde kein gemeinsamer Schlüssel vom Server übermittelt.
ru: Открытый ключ не был передан.

# SecurityException_ContextInfoMissing
source: Context information is missing.
de: Es wurden keine Kontextinformationen übertragen.
ru: Информация о контексте отсутствует.

# SecurityException_CredentialsMissing
source: Credentials missing.
de: Es wurden keine Anmeldeinformationen angegeben.
ru: Разрешения не определены.

# SecurityException_PasswordMissing
source: Password missing.
de: Es wurde kein Kennwort angegeben.
ru: Пароль не указан.

# SecurityException_UserNameMissing
source: User name missing.
de: Es wurde kein Benutzername angegeben.
ru: Имя пользователя не указано.

# SecurityException_WindowsTokenMissing
source: Windows security token credential missing.
de: Es wurde kein Windows-Sicherheitstoken übergeben.
ru: Маркер безопасности Windows отсутствует.

# UserNotAuthenicatedByWindows
source: User is not authenticated by operating system.
de: Benutzer wurde nicht von Windows authentifiziert.
ru: Пользователь не аутентифицирован операционной системой.

# ArgumentException_OutPutPinNameMissing
source: Outpit pin property name missing.
de: Es wurde kein Eigenschaftsname eines Ausgangs-Pins angegeben.
ru: Название свойства вывода отсутствует.

# ApplicationException_NotificationServiceNotRunning
source: Notification service is not running on the host.
de: Benachrichtigungsdienst ist auf dem Host nicht gestartet.
ru: Служба уведомлений на хосте не запущена.

# InvalidCredentials
source: Invalid user name or password.
de: Benutzername und/oder Kennwort sind nicht korrekt.
ru: Недопустимое имя пользователя или пароль.

# ApplicationException_NoChannel
source: No channel was created.
de: Es wurde kein Kanal erstellt.
ru: Канал не был создан.

# ArgumentException_TypeHasAlreadyAHandler
source: For type '{0}' is already a serialization handler registered.
de: Für Typ '{0}' ist bereits ein Serialisierungshandler registriert.
ru: Обработчик сериализации для типа '{0}' уже зарегистрирован.

# KeyNotFoundException_SerializationHandlerNotFound
source: No serialization handler is registered for type '{0}'.
de: Für Typ '{0}' ist kein Serialisierungshandler registriert.
ru: Обработчик сериализации для типа '{0}' не зарегистрирован.

# RemotingException_ConnectionError
source: Error connecting remote host: {0}.
de: Fehler beim Verbinden mit dem Remotehost: {0}.
ru: Ошибка соединения с удаленным хостом: {0}.

# SocketException_LostConnectionToServer
source: Lost connection to server '{0}'.
de: Verbindung zu Server '{0}' ist abgebrochen.
ru: Потеряно соединение с сервером '{0}'.

# ArgumentException_AddressMustNotBeEmpty
source: Address must not be empty.
de: Adresse darf nicht leer sein.
ru: Адрес не должен быть пустым.

# Format_Exception_InvalidAddressFormat
source: Invalid format for 'address' parameter: {0}
de: Ungültiges Format für Parameter 'address': {0}.
ru: Недопустимый формат для параметра 'address': {0}

# RemotingException_NoAddressForReconnect
source: No remote address specified for reconnect.
de: Keine Adresse zum Wiederverbinden vorhanden.
ru: Адрес для повторной установки соединения не указан.

# KeyNotFoundException_CannotFindComponentForInterface
source: Cannot find component for interface '{0}'.
ru: Не найден компонент для интерфейса '{0}'.

# InvalidSessionException_SessionIDInvalid
source: Session ID '{0}' is invalid. Please log on first.
ru: Идентификатор сессии '{0}' не найден. Вам необходимо войти в систему.

# MissingMethodException_MethodNotFound
source: Method not found: '{0}'.
ru: Метод не найден: '{0}'.

# AccountLockedException_DefaultMessage
source: Account is locked.
ru: Учетная запись заблокирована.

# AccountNotFoundException_DefaultMessage
source: Unknown username or bad password.
ru: Неизвестное имя пользователя или неверный пароль.

# PasswordExpiredException_DefaultMessage
source: Password is expired.
ru: Срок действия пароля истек.
